Revit 2027 API
MEPSystem.GetSectionByIndex Method
 Get the section from the index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSection GetSectionByIndex(
	int index
)
Public Function GetSectionByIndex (
	index As Integer
) As MEPSection
public:
MEPSection^ GetSectionByIndex(
	int index
)
member GetSectionByIndex :
        index : int -> MEPSection
Parameters
index Int32
 The index of the section in the system.
Return Value
MEPSection
 The section.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The section index is out of range.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace